[bk_find_ip_missing_geolocation]
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.severity = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 13,43 */4 * * *
description = Finner de ip-adressene brukt i innloggingssammenheng i datamodellen Authentication. Markerer de som ikke har geolocation data fra iplocation. Manglende geolocation data blir hentet fra ip-api python script
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["host","index","sourcetype","source"]
display.page.search.tab = statistics
enableSched = 1
schedule_window = auto
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = | tstats `summariesonly` count latest(_time) as _time from datamodel=Authentication.Authentication by Authentication.src ``` START: FIND IP ADDRESSES USED ```\
| `drop_dm_object_name(Authentication)`\
| eval isIP=if(match(src,"(([0-9a-fA-F]{1,4}:){7,7}[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,7}:|([0-9a-fA-F]{1,4}:){1,6}:[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,5}(:[0-9a-fA-F]{1,4}){1,2}|([0-9a-fA-F]{1,4}:){1,4}(:[0-9a-fA-F]{1,4}){1,3}|([0-9a-fA-F]{1,4}:){1,3}(:[0-9a-fA-F]{1,4}){1,4}|([0-9a-fA-F]{1,4}:){1,2}(:[0-9a-fA-F]{1,4}){1,5}|[0-9a-fA-F]{1,4}:((:[0-9a-fA-F]{1,4}){1,6})|:((:[0-9a-fA-F]{1,4}){1,7}|:)|fe80:(:[0-9a-fA-F]{0,4}){0,4}%[0-9a-zA-Z]{1,}|::(ffff(:0{1,4}){0,1}:){0,1}((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])|([0-9a-fA-F]{1,4}:){1,4}:((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9]))") OR match(src,"(\b25[0-5]|\b2[0-4][0-9]|\b[01]?[0-9][0-9]?)(\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}"),"true","false")\
\
| eval isIPv6=if(match(src,"(([0-9a-fA-F]{1,4}:){7,7}[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,7}:|([0-9a-fA-F]{1,4}:){1,6}:[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,5}(:[0-9a-fA-F]{1,4}){1,2}|([0-9a-fA-F]{1,4}:){1,4}(:[0-9a-fA-F]{1,4}){1,3}|([0-9a-fA-F]{1,4}:){1,3}(:[0-9a-fA-F]{1,4}){1,4}|([0-9a-fA-F]{1,4}:){1,2}(:[0-9a-fA-F]{1,4}){1,5}|[0-9a-fA-F]{1,4}:((:[0-9a-fA-F]{1,4}){1,6})|:((:[0-9a-fA-F]{1,4}){1,7}|:)|fe80:(:[0-9a-fA-F]{0,4}){0,4}%[0-9a-zA-Z]{1,}|::(ffff(:0{1,4}){0,1}:){0,1}((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])|([0-9a-fA-F]{1,4}:){1,4}:((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9]))"),"true","false")\
\
| eval isPrivateOrReserved=if(match(src,"(^127\.)|(^10\.)|(^172\.1[6-9]\.)|(^172\.2[0-9]\.)|(^172\.3[0-1]\.)|(^192\.168\.)|(^::ffff:127\.)|(^::ffff:10\.)|(^::ffff:172\.1[6-9]\.)|(^::ffff:172\.2[0-9]\.)|(^::ffff:172\.3[0-1]\.)|(^::ffff:192\.168\.)|(::1)|(^169\.254\.)"),"true", "false")\
| search isIP=true AND isIPv6=false AND isPrivateOrReserved=false ```ignoring ipv6 in initial version```\
| iplocation src\
| eval isMissingLocation = if(match(City,"^$")  OR match(Country,"^$") OR match(Region,"^$") OR isnull(City) OR isnull(Country) OR isnull(Region),"true","false") \
| sort - isMissingLocation\
| eval modifiedByPython=""\
``` END: FIND IP ADDRESSES USED ```\
``` START: APPEND LOOKUP THAT HAS BEEN MODIFIED ```\
| append \
    [| inputlookup splk_ip_external_lookup.csv]\
``` END: APPEND LOOKUP THAT HAS BEEN MODIFIED ```\
``` START: DEDUP SRC BY THOSE THAT have been modifiedByPython, else NEWEST _time ```\
| sort - modifiedByPython modifiedByPythonTimestamp _time\
| dedup src \
``` END: DEDUP SRC BY THOSE THAT have been modifiedByPython, else NEWEST _time ```\
| eval isPrivateOrReserved=if(match(src,"(^127\.)|(^10\.)|(^172\.1[6-9]\.)|(^172\.2[0-9]\.)|(^172\.3[0-1]\.)|(^192\.168\.)|(^::ffff:127\.)|(^::ffff:10\.)|(^::ffff:172\.1[6-9]\.)|(^::ffff:172\.2[0-9]\.)|(^::ffff:172\.3[0-1]\.)|(^::ffff:192\.168\.)|(::1)|(^169\.254\.)"),"true", "false")\
| outputlookup splk_ip_external_lookup.csv



# | tstats `summariesonly` count latest(_time) as _time from datamodel=Authentication.Authentication by Authentication.src ``` START: FIND IP ADDRESSES USED ```
# | `drop_dm_object_name(Authentication)`
# | eval isIP=if(match(src,"(([0-9a-fA-F]{1,4}:){7,7}[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,7}:|([0-9a-fA-F]{1,4}:){1,6}:[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,5}(:[0-9a-fA-F]{1,4}){1,2}|([0-9a-fA-F]{1,4}:){1,4}(:[0-9a-fA-F]{1,4}){1,3}|([0-9a-fA-F]{1,4}:){1,3}(:[0-9a-fA-F]{1,4}){1,4}|([0-9a-fA-F]{1,4}:){1,2}(:[0-9a-fA-F]{1,4}){1,5}|[0-9a-fA-F]{1,4}:((:[0-9a-fA-F]{1,4}){1,6})|:((:[0-9a-fA-F]{1,4}){1,7}|:)|fe80:(:[0-9a-fA-F]{0,4}){0,4}%[0-9a-zA-Z]{1,}|::(ffff(:0{1,4}){0,1}:){0,1}((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])|([0-9a-fA-F]{1,4}:){1,4}:((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9]))") OR match(src,"(\b25[0-5]|\b2[0-4][0-9]|\b[01]?[0-9][0-9]?)(\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}"),"true","false")
# | eval isIPv6=if(match(src,"(([0-9a-fA-F]{1,4}:){7,7}[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,7}:|([0-9a-fA-F]{1,4}:){1,6}:[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,5}(:[0-9a-fA-F]{1,4}){1,2}|([0-9a-fA-F]{1,4}:){1,4}(:[0-9a-fA-F]{1,4}){1,3}|([0-9a-fA-F]{1,4}:){1,3}(:[0-9a-fA-F]{1,4}){1,4}|([0-9a-fA-F]{1,4}:){1,2}(:[0-9a-fA-F]{1,4}){1,5}|[0-9a-fA-F]{1,4}:((:[0-9a-fA-F]{1,4}){1,6})|:((:[0-9a-fA-F]{1,4}){1,7}|:)|fe80:(:[0-9a-fA-F]{0,4}){0,4}%[0-9a-zA-Z]{1,}|::(ffff(:0{1,4}){0,1}:){0,1}((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])|([0-9a-fA-F]{1,4}:){1,4}:((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9]))"),"true","false")
# | eval isPrivateOrReserved=if(match(src,"(^127\.)|(^10\.)|(^172\.1[6-9]\.)|(^172\.2[0-9]\.)|(^172\.3[0-1]\.)|(^192\.168\.)|(^::ffff:127\.)|(^::ffff:10\.)|(^::ffff:172\.1[6-9]\.)|(^::ffff:172\.2[0-9]\.)|(^::ffff:172\.3[0-1]\.)|(^::ffff:192\.168\.)|(::1)"),"true", "false")
# | search isIP=true AND isIPv6=false AND isPrivateOrReserved=false ```ignoring ipv6 in initial version```
# | iplocation src
# | eval isMissingLocation = if(match(City,"^$")  OR match(Country,"^$") OR match(Region,"^$") OR isnull(City) OR isnull(Country) OR isnull(Region),"true","false") 
# | sort - isMissingLocation
# | eval modifiedByPython=""
# ``` END: FIND IP ADDRESSES USED ```
# ``` START: APPEND LOOKUP THAT HAS BEEN MODIFIED ```
# | append 
#     [| inputlookup splk_ip_external_lookup.csv]
# ``` END: APPEND LOOKUP THAT HAS BEEN MODIFIED ```
# ``` START: DEDUP SRC BY THOSE THAT have been modifiedByPython, else NEWEST _time ```
# | sort - modifiedByPython modifiedByPythonTimestamp _time
# | dedup src 
# ``` END: DEDUP SRC BY THOSE THAT have been modifiedByPython, else NEWEST _time ```
# | eval isPrivateOrReserved=if(match(src,"(^127\.)|(^10\.)|(^172\.1[6-9]\.)|(^172\.2[0-9]\.)|(^172\.3[0-1]\.)|(^192\.168\.)|(^::ffff:127\.)|(^::ffff:10\.)|(^::ffff:172\.1[6-9]\.)|(^::ffff:172\.2[0-9]\.)|(^::ffff:172\.3[0-1]\.)|(^::ffff:192\.168\.)|(::1)|(^169\.254\.)"),"true", "false")
# | outputlookup splk_ip_external_lookup.csv